Revit 2027 API
BuiltInFailures.StairRampFailures.MultusegmentRampRiser Property
 Ramp can't have multisegment Riser.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultusegmentRampRiser { get; }
Public Shared ReadOnly Property MultusegmentRampRiser As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultusegmentRampRiser {
	FailureDefinitionId^ get ();
}
static member MultusegmentRampRiser : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace